temp1/src/InformationRegisters/СвязиДокументов/СвязиДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязиДокументов</name>
  <resources>
    <name>СвязанныйДокументОтправлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Установил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.Задачи</types>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСвязи</name>
    <type>
      <types>CatalogRef.ТипыСвязей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СвязанныйДокумент</name>
    <type>
      <types>DocumentRef.Задачи</types>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СвязаннаяСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

temp1/src/Catalogs/ТипыСвязей/ТипыСвязей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыСвязей</name>
  <predefined>
    <items>
      <name>ДелаетНеДействующим</name>
      <description>Делает недействующим</description>
    </items>
    <items>
      <name>НаОснованииПисьма</name>
      <description>На основании письма</description>
    </items>
    <items>
      <name>НеДействуетВСоответствии</name>
      <description>Не действует в соответствии</description>
    </items>
    <items>
      <name>ОтправленВОтветНа</name>
      <description>Отправлен в ответ на</description>
    </items>
    <items>
      <name>ВОтветНаПереадресованное</name>
      <description>Отправлен в ответ на переадресованное</description>
    </items>
    <items>
      <name>ОтправленВОтветНаПисьмо</name>
      <description>Отправлен в ответ на письмо</description>
    </items>
    <items>
      <name>ОтправленОтвет</name>
      <description>Отправлен ответ</description>
    </items>
    <items>
      <name>ОтправленОтветныйДокумент</name>
      <description>Отправлен ответный документ</description>
    </items>
    <items>
      <name>ОтправленоОтветноеПисьмо</name>
      <description>Отправлено ответное письмо</description>
    </items>
    <items>
      <name>ПеренаправлениеПисьма</name>
      <description>Перенаправление письма</description>
    </items>
    <items>
      <name>ПеренаправленоПисьмом</name>
      <description>Перенаправлено письмом</description>
    </items>
    <items>
      <name>ПерепискаПоПредмету</name>
      <description>Переписка по предмету</description>
    </items>
    <items>
      <name>ПересланоПисьмом</name>
      <description>Переслано письмом</description>
    </items>
    <items>
      <name>ПересылкаПисьма</name>
      <description>Пересылка письма</description>
    </items>
    <items>
      <name>ПисьмоОтправленоВОтветНа</name>
      <description>Письмо отправлено в ответ на</description>
    </items>
    <items>
      <name>ПисьмоОснование</name>
      <description>Письмо-основание</description>
    </items>
    <items>
      <name>ПолученВОтветНа</name>
      <description>Получен в ответ на</description>
    </items>
    <items>
      <name>ПолученВОтветНаПисьмо</name>
      <description>Получен в ответ на письмо</description>
    </items>
    <items>
      <name>ПолученОтвет</name>
      <description>Получен ответ</description>
    </items>
    <items>
      <name>ПолученоВОтветНаПисьмо</name>
      <description>Получено в ответ на письмо</description>
    </items>
    <items>
      <name>ПолученоОтветноеПисьмо</name>
      <description>Получено ответное письмо</description>
    </items>
    <items>
      <name>ПредметПереписки</name>
      <description>Содержит переписку по</description>
    </items>
    <items>
      <name>СодержитСсылкуНаИнтегрированныйОбъект</name>
      <description>Содержит ссылку на</description>
    </items>
    <items>
      <name>ОсновноеОбращение</name>
      <description>Является дубликатом для</description>
    </items>
    <items>
      <name>Дубликат</name>
      <description>Является основным для</description>
    </items>
    <items>
      <name>ПовторноеОбращение</name>
      <description>Является первичным для</description>
    </items>
    <items>
      <name>ПервичноеОбращение</name>
      <description>Является повторным для</description>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

temp1/src/InformationRegisters/СвязиДокументов/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для каждого Запись Из ЭтотОбъект Цикл
		
		СвязанныйДокумент = Неопределено;
		Если ЗначениеЗаполнено(Запись.СвязанныйДокумент) Тогда 
			СвязанныйДокумент = Запись.СвязанныйДокумент;
		ИначеЕсли ЗначениеЗаполнено(Запись.СвязаннаяСтрока) Тогда 
			СвязанныйДокумент = Запись.СвязаннаяСтрока;
		КонецЕсли;
		
		//НастройкиСвязи = СвязиДокументов.ПолучитьНастройкуСвязи(Запись.Документ, СвязанныйДокумент, Запись.ТипСвязи);
		//Если НастройкиСвязи = Неопределено Тогда 
		//	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		//		НСтр("ru = 'Записываемая связь не соответствует настройкам для типа связи! Связи документов: %1, %2, %3'"), 
		//		Запись.Документ, Запись.ТипСвязи, СвязанныйДокумент);
		//	ВызватьИсключение ТекстСообщения;
		//КонецЕсли;
		//
		//ХарактерСвязи = НастройкиСвязи.ХарактерСвязи;
		//Если ХарактерСвязи = Перечисления.ХарактерСвязей.Единичная Тогда 
		//	Запрос = Новый Запрос;
		//	Запрос.Текст = 
		//	"ВЫБРАТЬ ПЕРВЫЕ 2
		//	|	СвязиДокументов.Документ,
		//	|	СвязиДокументов.ТипСвязи,
		//	|	СвязиДокументов.СвязанныйДокумент,
		//	|	СвязиДокументов.СвязаннаяСтрока,
		//	|	СвязиДокументов.Комментарий,
		//	|	СвязиДокументов.Установил,
		//	|	СвязиДокументов.ДатаУстановки
		//	|ИЗ
		//	|	РегистрСведений.СвязиДокументов КАК СвязиДокументов
		//	|ГДЕ
		//	|	СвязиДокументов.ТипСвязи = &ТипСвязи
		//	|	И СвязиДокументов.Документ = &Документ";
		//	Запрос.УстановитьПараметр("ТипСвязи", Запись.ТипСвязи);
		//	Запрос.УстановитьПараметр("Документ", Запись.Документ);
		//	
		//	Выборка = Запрос.Выполнить().Выбрать();
		//	
		//	Если Выборка.Количество() > 1 Тогда 
		//		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		//			НСтр("ru = 'Для документа %1 не может быть установлено более одной единичной связи %2!'"), 
		//			Запись.Документ, Запись.ТипСвязи);
		//		ВызватьИсключение ТекстСообщения;
		//	КонецЕсли;
		//КонецЕсли;
	КонецЦикла;
		
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Заполнение РС КешИнформацииОбОбъектах
	СвязиПисем = Новый ТаблицаЗначений;
	СвязиПисем.Колонки.Добавить("Письмо");
	СвязиПисем.Колонки.Добавить("Признак");
	СвязиПисем.Колонки.Добавить("КоличествоСвязей");
	
	СписокПисем = Новый Массив;
	
	Если Замещение Тогда
		ТекущееЗначениеНабора = ЭтотОбъект.Выгрузить();
		ЭтотОбъект.Прочитать();
		Для каждого Запись Из ЭтотОбъект Цикл
			Если ВстроеннаяПочтаКлиентСервер.ЭтоПисьмо(Запись.Документ)
				И (Запись.ТипСвязи = Справочники.ТипыСвязей.ОтправленоОтветноеПисьмо
				Или Запись.ТипСвязи = Справочники.ТипыСвязей.ПересланоПисьмом
				Или Запись.ТипСвязи = Справочники.ТипыСвязей.ПеренаправленоПисьмом
				Или Запись.ТипСвязи = Справочники.ТипыСвязей.ПолученоОтветноеПисьмо) Тогда
				СписокПисем.Добавить(Запись.Документ);
				
				СвязиПисемСтрока = СвязиПисем.Добавить();
				СвязиПисемСтрока.Письмо = Запись.Документ;
				СвязиПисемСтрока.Признак = СвязиДокументов.ПолучитьИмяПризнакаДляТипаСвязи(Запись.ТипСвязи);
				СвязиПисемСтрока.КоличествоСвязей = -1;
			КонецЕсли;
		КонецЦикла;
		ЭтотОбъект.Загрузить(ТекущееЗначениеНабора);
	КонецЕсли;
	
	Для каждого Запись Из ЭтотОбъект Цикл
		Если ВстроеннаяПочтаКлиентСервер.ЭтоПисьмо(Запись.Документ)
			И (Запись.ТипСвязи = Справочники.ТипыСвязей.ОтправленоОтветноеПисьмо
			Или Запись.ТипСвязи = Справочники.ТипыСвязей.ПересланоПисьмом
			Или Запись.ТипСвязи = Справочники.ТипыСвязей.ПолученоОтветноеПисьмо) Тогда
			СписокПисем.Добавить(Запись.Документ);
			
			СвязиПисемСтрока = СвязиПисем.Добавить();
			СвязиПисемСтрока.Письмо = Запись.Документ;
			СвязиПисемСтрока.Признак = СвязиДокументов.ПолучитьИмяПризнакаДляТипаСвязи(Запись.ТипСвязи);
			СвязиПисемСтрока.КоличествоСвязей = 1;
		КонецЕсли;
	КонецЦикла;
	
	Если СвязиПисем.Количество() > 0 Тогда
		Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	СвязиДокументов.Документ КАК Ссылка,
			|	СвязиДокументов.ТипСвязи
			|ИЗ
			|	РегистрСведений.СвязиДокументов КАК СвязиДокументов
			|ГДЕ
			|	СвязиДокументов.Документ В(&СписокПисем)
			|	И (СвязиДокументов.ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязей.ОтправленоОтветноеПисьмо)
			|			ИЛИ СвязиДокументов.ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязей.ПересланоПисьмом)
			|			ИЛИ СвязиДокументов.ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязей.ПолученоОтветноеПисьмо))");
		Запрос.УстановитьПараметр("СписокПисем", СписокПисем);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СвязиПисемСтрока = СвязиПисем.Добавить();
			СвязиПисемСтрока.Письмо = Выборка.Ссылка;
			СвязиПисемСтрока.Признак = СвязиДокументов.ПолучитьИмяПризнакаДляТипаСвязи(Выборка.ТипСвязи);
			СвязиПисемСтрока.КоличествоСвязей = 1;
		КонецЦикла;
		
		СвязиПисем.Свернуть("Письмо, Признак", "КоличествоСвязей");
		Для каждого СвязиПисемСтрока Из СвязиПисем Цикл
			РегистрыСведений.КешИнформацииОбОбъектах.УстановитьПризнак(
				СвязиПисемСтрока.Письмо,
				СвязиПисемСтрока.Признак,
				СвязиПисемСтрока.КоличествоСвязей > 0);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
